# ANA BAŞLIK

## Aggregate (ileri toplulaştırma İşlemleri)

In [6]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"gruplar": ["A" , "B" , "C" , "A" , "B" , "C"] ,
                "degisken1": [10,23,33,22,11,99] , 
                "degisken2": [100, 253,333,262,111,969]} ,
               columns=["gruplar" , "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [47]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [2]:
#aggregate

In [4]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [49]:
df.groupby("gruplar").aggregate

In [51]:
?aggregate

Object `aggregate` not found.

In [11]:
df.groupby("gruplar").aggregate(["min" , np.median , "max" ])
# np.median tırnak içerisine alınamaz. kayıtlı olan kütüphaneler " içinde
# olursa çalışır fakat dışsal fonksiyonu algılayamıyor (np. içerisinde)

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10   16.0  22       100  181.0  262
B              11   17.0  23       111  182.0  253
C              33   66.0  99       333  651.0  969

In [12]:
df.groupby("gruplar").aggregate({"degisken1": min , "degisken2": max})
#degisken1 için

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

## filter
hem kendi fonksiyonunu yapacaksın hem de bu fonksiyonu df'ye atarak koşul kontrol edeceksin

In [13]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"gruplar": ["A" , "B" , "C" , "A" , "B" , "C"] ,
                "degisken1": [10,23,33,22,11,99] , 
                "degisken2": [100, 253,333,262,111,969]} ,
               columns=["gruplar" , "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [20]:
def filter_func(x):
    return x["degisken1"].std() >9

In [18]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [21]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

## transform

In [22]:
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [24]:
df["degisken1"]*9

0     90
1    207
2    297
3    198
4     99
5    891
Name: degisken1, dtype: int64

In [27]:
df_a=df.iloc[: , 1:3]
df_a

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [29]:
df_a.transform(lambda x: x-x.mean()) #lambda bir fonksiyon mimarisi yaratmadan kullanmaya yarıyor

   degisken1  degisken2
0      -23.0     -238.0
1      -10.0      -85.0
2        0.0       -5.0
3      -11.0      -76.0
4      -22.0     -227.0
5       66.0      631.0

In [33]:
df_a.transform(lambda x: (x-x.mean()) / x.std())  
# yakaladığı her bir değişkenden(x) o değişkenin ortalamasını çıkaracak ve o değişkenin std sapmasına bölecek

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

## apply

In [36]:
import numpy as np
import pandas as pd
df=pd.DataFrame({
                "degisken1": [10,23,33,22,11,99] , 
                "degisken2": [100, 253,333,262,111,969]} ,
               columns=[ "degisken1", "degisken2"])
df

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

In [38]:
# apply fonksiyonu gezinme yeteneği var toplulaştırma amacıyla kullanılır

In [39]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [40]:
df.apply(np.median)

degisken1     22.5
degisken2    257.5
dtype: float64

In [41]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [42]:
import numpy as np
import pandas as pd
df=pd.DataFrame({"gruplar": ["A" , "B" , "C" , "A" , "B" , "C"] ,
                "degisken1": [10,23,33,22,11,99] , 
                "degisken2": [100, 253,333,262,111,969]} ,
               columns=["gruplar" , "degisken1", "degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [43]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [44]:
df.groupby("gruplar").apply(np.median)

gruplar
A     61.0
B     67.0
C    216.0
dtype: float64